acesso/Signal-Decoder/firmware/esp32-cat-bridge/sdkconfig.defaults
# Baseline project defaults for the ESP32 CAT bridge. idf.py set-target esp32
# generates the full sdkconfig from these + component defaults; this file
# only overrides what matters for this project (target chip, partition
# table headroom, log level). Wi-Fi SSID/password/CAT baud are in
# Kconfig.projbuild ("CAT Bridge Config" menu) and land in the generated
# sdkconfig (gitignored) — not committed here since they're per-deployment.

CONFIG_IDF_TARGET="esp32"

# Target board: AI-Thinker ESP32-A1S Audio Kit — 4MB flash (the ESP-IDF
# default assumes 2MB, which is wrong for this board and would make
# esptool misjudge the flash layout).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# 8MB PSRAM is physically present on this WROVER-class module (see README's
# "PSRAM is present but unused" note — this is what makes it used). DIO
# flash mode remains compatible with PSRAM on original ESP32 (esp_psram's
# own Kconfig only requires the PSRAM WP/SD3 pin be correct, which ESP-IDF
# auto-selects here; no QIO switch needed).
#
# Deliberately NOT setting CONFIG_SPIRAM_USE_MALLOC — plain malloc() stays
# internal-RAM-only by default. Candidate buffers opt into PSRAM explicitly
# via heap_caps_malloc(..., MALLOC_CAP_SPIRAM) at their own call sites
# (see http_control.c, cpu_monitor.c, wifi_net.c, ws_server.c, audio_ws.c,
# audio_sniff.c, audio_iq.c, cat_log.c) rather than letting every malloc()
# in the codebase silently become PSRAM-eligible — the time-critical I2S/
# CAT/PA-watchdog path must never land there (PSRAM can't back DMA
# allocations and has materially higher access latency than internal RAM),
# and an explicit opt-in per call site is a much safer way to guarantee
# that than trusting SPIRAM_MALLOC_ALWAYSINTERNAL's size threshold to catch
# every case correctly forever as the firmware evolves.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_40M=y
# SPI RAM access method is a Kconfig CHOICE (SPIRAM_USE_MEMMAP /
# SPIRAM_USE_CAPS_ALLOC / SPIRAM_USE_MALLOC), defaulting to
# SPIRAM_USE_MALLOC (esp_psram/Kconfig.spiram.common) — that default would
# make every plain malloc() in this codebase PSRAM-eligible, including the
# still-malloc()-based hot-path buffers in audio_monitor.c (the
# per-iteration I2S read buffer, fed straight into esp_codec_dev_read) and
# the TX-path buffer in audio_ws.c that was deliberately kept off PSRAM.
# Explicitly selecting SPIRAM_USE_CAPS_ALLOC instead means PSRAM is ONLY
# reachable via heap_caps_malloc(..., MALLOC_CAP_SPIRAM) — plain malloc()
# always stays internal-RAM-only, no exceptions, regardless of allocation
# size or allocator heuristics. (A single "# X is not set" line does NOT
# override a choice's default — the fix is selecting a different member of
# the choice, which is what this does.)
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# esp_http_server + mdns + wifi together need more than the default 4KB
# main-task stack during init (mdns_init/httpd_start allocate on the
# calling task's stack in places).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Custom table (partitions.csv) — carries a "storage" SPIFFS partition for
# the standalone control page (see main/control_page.c) alongside a single
# 1.5MB app slot (no OTA, same as the single-app default, just resized to
# make room for SPIFFS on the same 4MB flash).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# httpd_ws_frame_t / HTTPD_WS_TYPE_* / httpd_ws_send_frame_async etc. are all
# compiled out of esp_http_server unless this is enabled — required for the
# /cat WebSocket route in ws_server.c.
CONFIG_HTTPD_WS_SUPPORT=y

# Core 1 is reserved for the CAT UART reader task alone (see
# CAT_BRIDGE_TASK_CORE in bridge_config.h) — the Wi-Fi driver task already
# defaults to core 0 (CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_0, unchanged
# here), but lwIP's TCPIP task defaults to NO affinity, meaning it could
# otherwise land on core 1 and contend with the CAT UART reader for CPU
# time. Pin it to core 0 explicitly to close that gap.
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y

# Default (10) wasn't enough once /audio joined /cat on the same httpd
# instance — httpd_start() reserves 3 sockets internally, so
# ws_server.c's max_open_sockets (WS_MAX_CLIENTS + AUDIO_WS_MAX_CLIENTS + 2
# = 8) needs LWIP_MAX_SOCKETS >= 11. Discovered as an ESP_ERR_INVALID_ARG
# abort() boot-loop on real hardware. Rounded up for headroom.
CONFIG_LWIP_MAX_SOCKETS=16

# Enables esp_pm_configure() so main/cpu_monitor.c can live-set the CPU
# frequency from the control page (POST /cpu-freq) — a diagnostic tool for
# an audio-noise investigation (whether digital switching activity is
# coupling into the analog input path), not something this firmware
# otherwise needs power management for. main/app_main.c always calls
# esp_pm_configure() with min_freq_mhz == max_freq_mhz at boot (both pinned
# to the same value) specifically so no ACTUAL dynamic scaling ever
# happens on its own — only an explicit POST /cpu-freq call ever changes
# the pinned frequency. Light-sleep automatic entry (the other half of
# ESP-IDF's PM subsystem) is left at its default (off) below.
CONFIG_PM_ENABLE=y
# Tickless idle needs to stay off — enabling it here would let FreeRTOS
# actually enter light-sleep during idle periods, which is real, additional
# switching behavior this investigation does NOT want to introduce (the
# whole point is a single fixed, unchanging frequency, not "usually X MHz
# except during a sleep/wake cycle").
# CONFIG_FREERTOS_USE_TICKLESS_IDLE is not set

# Per-task CPU usage stats for the same control-page diagnostics panel (see
# cpu_monitor.c) — auto-selects FREERTOS_USE_TRACE_FACILITY. Left on the
# default esp_timer clock source (not the CPU clock) deliberately: the CPU
# clock's own tick rate would skew these stats every time POST /cpu-freq
# changes the pinned frequency, since esp_timer runs independently of it.
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# Reports which core (0/1) each task is pinned to alongside its CPU% —
# genuinely useful on THIS firmware specifically, since bridge_config.h's
# whole task-placement design (core 0 = Wi-Fi/httpd, core 1 = CAT/audio/PA
# watchdog) is deliberate isolation the diagnostics panel should be able
# to actually show, not just per-task % with no core context.
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

# Task watchdog (CONFIG_ESP_TASK_WDT_EN, already on by default) was
# previously left at ITS OWN default of log-only on trip
# (CONFIG_ESP_TASK_WDT_PANIC unset) — meaning if some task ever genuinely
# starves the CPU for CONFIG_ESP_TASK_WDT_TIMEOUT_S (5s), the bridge just
# logs a warning and keeps limping in whatever wedged state caused the
# starvation, rather than recovering. That's indistinguishable from a full
# hang to anyone not watching the serial console — and matches a real
# report of the bridge going completely unresponsive after the PA emergency
# watchdog fired, requiring a manual power-cycle to clear (see
# pa_watchdog.c's PA_SENSE_PIN pull-down comment — the leading suspect there
# is a floating sense pin reading noise, not this, but this is a
# worthwhile safety net regardless of root cause). Panicking on a genuine
# task-starvation hang reboots automatically instead of requiring a human
# to notice and power-cycle it.
CONFIG_ESP_TASK_WDT_PANIC=y

# NOTE: a WiFi dynamic-buffer-count reduction (32->16 for RX/TX/cache) was
# tried here as a mitigation for /iq-data-during-TX contention, but the
# user reported it made real-world TX degradation MORE noticeable, not
# less — reverted pending further investigation. Real-hardware profiling
# numbers (before revert) are preserved in the "Suspend I/Q spectrum
# during TX" toggle's comment (RadioCATPanel.tsx/useFTTransmit.ts) and in
# scripts/tx-plus-iqspectrum-profile.ts's own header for reference; don't
# re-apply this specific change without re-confirming against real
# hardware first.
